{"keras_version": "2.2.0", "config": [{"config": {"data_format": "channels_last", "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "filters": 32, "bias_constraint": null, "activation": "linear", "batch_input_shape": [null, 150, 150, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "filters": 32, "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "filters": 64, "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_3", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 64, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"units": 1, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_2", "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "activation_5", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}