{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.0", "config": [{"class_name": "Flatten", "config": {"dtype": "float32", "batch_input_shape": [null, 4, 4, 512], "trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 256, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 1, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_constraint": null}}]}